[{"url": "https://hh.ru/vacancy/83166142", "platform": "hh.ru", "salary": 250000, "description": "\nТребования: Опыт работы с Python от 1,5 лет. Опыт работы с любым фреймворком для веб-приложений. Уверенный пользователь Linux, Docker. \nОбязанности: Принять участие в разработке нового проекта как backend разработчик. Коммуникация с другими разработчиками и участие в выборе новых технологий. ", "title": "Python разработчик", "area": "Тбилиси", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/81940901", "platform": "hh.ru", "salary": 250000, "description": "\nТребования: Высшее техническое образование или самостоятельный бэкграунд в области робототехники и смежных областей. Опыт разработки и проектирования робототехнических систем. \nОбязанности: Разрабатывать программную начинку робота для уборки улиц. Построить релизный цикл. Автоматизировать тестирование в симуляции для написанного кода. Дорабатывать системы навигации...", "title": "Senior Python Developer (AI, robotics)", "area": "Москва", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/81870188", "platform": "hh.ru", "salary": 150000, "description": "\nТребования: Знание классических алгоритмов и структур данных. Опыт работы с асинхронным <highlighttext>питоном</highlighttext>. Умение работать с raw SQL (писать и оптимизировать запросы...\nОбязанности: Backend разработка, Full Stack разработка. Задачи по разработке API, микросервисов, интеграции различных систем, обработка и анализ данных, пользовательский web-интерфейс.", "title": "Разработчик Python", "area": "Москва", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/78850529", "platform": "hh.ru", "salary": 150000, "description": "\nТребования: Опыт с API Яндекс Метрики, Яндекс Директ, AppMetrica, VK. SQL на высоком уровне (подзапросы, оконные функции, и проч.), чтобы доставать...\nОбязанности: Строить BI-отчетность в Metabase и соответствующие витрины данных. Помогать команде по маркетингу и продукту понять насколько их инициативы эффективны...", "title": "Продуктовый аналитик | Аналитик данных", "area": "Москва", "experience": "От 3 до 6 лет"}, {"url": "https://hh.ru/vacancy/75915219", "platform": "hh.ru", "salary": 75000, "description": "\nТребования: Знание ЕСКД, допуски и посадки. Умение читать чертежи. Приветствуется знание НКУ. Приветствуется знание программы Solid Works.\nОбязанности: Подготовка комплектации оборудования и чертежей. Разработка КД.", "title": "Инженер-конструктор", "area": "Нижнекамск", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/82825127", "platform": "hh.ru", "salary": 70000, "description": "\nТребования: Навыки работы с Python/Django. Навыки работы с MySQL/Postgres, Redis. Навыки работы с HTML/CSS. Опыт работы с Linux...\nОбязанности: Написание API на Python/Django. Работа по интеграции и внедрению нашего продукта. Написание автоматического тестирования / RPA / кликеров. Автоматизация выполнения фоновых...", "title": "Junior/Middle Python Developer (Backend) - разработчик Питон", "area": "Новосибирск", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/82176208", "platform": "hh.ru", "salary": 50000, "description": "\nТребования: Грамотная речь. -Умение находить подход к каждому гостю. -Стрессоустойчивость, вежливость, внимательность и пунктуальность. -Желание работать и зарабатывать. -Ответственный подход к...\nОбязанности: Встреча и посадка гостей. -Соблюдение стандартов компании с индивидуальным подходом к каждому гостю. -Поддержание веселой атмосферы в клубе. -", "title": "Хостес", "area": "Новосибирск", "experience": "Нет опыта"}, {"url": "https://hh.ru/vacancy/79870344", "platform": "hh.ru", "salary": 50000, "description": "\nТребования: Опыт работы на производстве от 1 года. Среднее и/или средне-специальное образование. Умение читать схемы и чертежи.\nОбязанности: Обработка деталей на станках с числовым программным управлением. Проверка качества обработки деталей контрольно-измерительными инструментами. Наладка узлов и механизмов в...", "title": "Оператор станка с ЧПУ", "area": "Нижнекамск", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/79112349", "platform": "hh.ru", "salary": 45000, "description": "\nТребования: Знание основ измерений. Умение работать с конструкторской документацией (чертежи). Практические навыки измерений универсальным измерительным инструментом (штангенциркуль, нутромер, глубиномер, угломер, микрометр...\nОбязанности: Входной контроль, проверка качества выпускаемой продукции. Промежуточный контроль продукции. Окончательная техническая приемка готовой продукции. При приемке продукции контроль комплектности, консервации...", "title": "Инженер по качеству", "area": "Нижнекамск", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/80515494", "platform": "hh.ru", "salary": 45000, "description": "\nТребования: Профильным образованием. Знаниями базовой школьной информатики. Знаниями основ программирования на языке Python или Pascal. Знаниями основ HTML,CSS. \nОбязанности: Преподавательская деятельность с детьми школьного возраста.", "title": "Учитель информатики, информационные технологии", "area": "Екатеринбург", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/82583080", "platform": "hh.ru", "salary": 40000, "description": "\nТребования: Владение библиотеками <highlighttext>питона</highlighttext>: numpy, pandas. Опыт в Data Engineering. Будет плюсом опыт работы с AWS S3, AirFlow, grpc AirFlow...\nОбязанности: Регулярная загрузка данных через API Refinitive с помощью Python. Обработка данных, устранение несовершенств данных, улучшение архитектуры баз данных. ", "title": "Data engineer", "area": "Казань", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/82738013", "platform": "hh.ru", "salary": 25000, "description": "\nТребования: Знание программы R-keeper-6,7.IIko. Позитивное мышление.\nОбязанности: Гостеприимное, вежливое, приветливое обслуживание, соблюдение стандартов компании с индивидуальным подходом к каждому гостю.", "title": "Официант", "area": "Новосибирск", "experience": "Нет опыта"}, {"url": "https://hh.ru/vacancy/82002341", "platform": "hh.ru", "salary": null, "description": "\nТребования: Профессиональное образование, желание учить детей.\nОбязанности: ...на 3D принтере, внеурочная деятельность по авиамоделированию, программирование на языках <highlighttext>ПИТОН</highlighttext> и тд - ученики 7-8 классов. Классное руководство.", "title": "Учитель технологии", "area": "Иркутск", "experience": "Нет опыта"}]