[{"url": "https://hh.ru/vacancy/82933897", "salary": 55000, "description": "\nТребования: Базовые навыки: HTML, CSS, JavaScript. Кроссбраузерная, адаптивная / гибкая / Pixel Perfect верстка. Опыт программирования: от 0 до 1 года. \nОбязанности: Фреймворки и библиотеки: Vue / React.js. Система контроля версий git. Верстки по макетам из Figma / FigJam. Взаимодействие с сервером: REST API...", "title": "Junior Frontend разработчик (Стажер)", "area": "Москва", "experience": "Нет опыта"}, {"url": "https://hh.ru/vacancy/83055812", "salary": 80000, "description": "\nТребования: Требуемые навыки: Опыт работы не менее 6 месяцев. Знание <highlighttext>Python</highlighttext>. Представление об ООП. Представление о работе с БД, понимание основных...\nОбязанности: Описание проекта: Обойтись. Основную часть работы составляет backend-разработка, требующая. Решения разнообразных нетривиальных задач, в том числе с взаимодействием. ", "title": "Junior backend-разработчик на Python", "area": "Москва", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/83099990", "salary": 85000, "description": "\nТребования: Готовность быстро учиться и развивать в себе недостающие навыки. Будет являться преимуществом навыки программирования. Будет являться преимуществом знание SQL, <highlighttext>Python</highlighttext>.\nОбязанности: Сбор и анализ данных по пассажиропотокам в различных плоскостях. Формирование и ведение базы ключевых показателей транспортных перевозок. Участие в разработке...", "title": "Специалист отдела аналитики", "area": "Москва", "experience": "Нет опыта"}, {"url": "https://hh.ru/vacancy/81667130", "salary": 50000, "description": "\nТребования: <highlighttext>Python</highlighttext>, sqlalchemy. Nginx, postgesql / mysql, redis. Linux / macos. Git. Rest. Умение разбираться в чужом коде.\nОбязанности: Участие в разработке микросервисов и интернет порталов.", "title": "Junior Python Developer", "area": "Москва", "experience": "Нет опыта"}, {"url": "https://hh.ru/vacancy/82844540", "salary": 150000, "description": "\nТребования: Что нужно знать/уметь: - Иметь знакомство с <highlighttext>Python</highlighttext> (pandas) или возможность быстро погрузиться в него на уровне подготовки табличных данных. - \nОбязанности: ...в Excel, включая объединение таблиц, сводные таблицы, формулы массивов и прочее. VBA не используем, подготовку такого уровня делаем в <highlighttext>Python</highlighttext>.", "title": "Аналитик данных, Excel + визуализации", "area": "Москва", "experience": "От 3 до 6 лет"}, {"url": "https://hh.ru/vacancy/83048538", "salary": 140000, "description": "\nТребования: Уверенное владение JavaScript, HTML, CSS. Опыт работы с React JS. Опыт разработки с использованием REST API. Понимание принципов адаптивной и...\nОбязанности: Доработка веб-интерфейса платформы для селекционеров. Интеграция с бэкендом (REST API). Взаимодействие с бэкенд-разработчиками и бизнес-аналитиком для проектирования...", "title": "Фронтенд-разработчик", "area": "Москва", "experience": "От 1 года до 3 лет"}, {"url": "https://www.superjob.ru/clients/yandeks-ooo-yandeks-3237849/vacancies.html", "salary": 15000, "description": "Для помощи по вопросам десктопной версии Яндекс.Браузера разыскивается человек, который умеет не только выйти в интернет, но и знает, как потом не принести из него что-то вредное. Ваши сверхспособности понадобятся, чтобы знакомить пользователей с полезными возможностями Браузера. Например, рассказывать, как настроить фильтр рекламы или синхронизировать настройки Браузера на нескольких устройствах. Если вы из тех, кому любопытно разбираться, почему что-то не работает, и нравится помогать людям, присоединяйтесь.\nЧто нужно делать:\n· отвечать на сообщения пользователей по почте и в чатах;\n· консультировать их о вопросах, связанных с Яндексом;\n· передавать информацию разработчикам и менеджерам, помогая улучшать сервисы;\n· иногда решать новые интересные задачи — ведь мы постоянно растем и меняемся.\nМы ждем, что вы:\n· грамотно пишете по-русски;\n· умеете четко и структурированно излагать мысли;\n· легко находите главную информацию в текстах разного объема;\n· умеете читать языки JavaScript, HTML и Python;\n· имеете высшее или неоконченное высшее образование (техническое будет плюсом);\n· помогали людям онлайн;\n· умеете работать самостоятельно и в команде;\n· готовы к гибкому графику;\n· ответственны, стрессоустойчивы, самоорганизованны;\n· умеете работать с большим объемом информации;\n· готовы учиться;\n· не устаете от однообразных задач.\nУсловия:\n· работа из дома;\n· оформление совместительства;\n· частичная занятость: 20 рабочих часов в неделю;\n· гибкий график: 5-дневная рабочая неделя, 4 рабочих часа в день, плавающие выходные, начало смен обсуждается индивидуально;\n· сдельная оплата;\n· удаленное оплачиваемое обучение.\n Доступно соискателям с инвалидностью", "title": "Специалист службы поддержки с техническими знаниями (Браузер)", "area": "Чита", "experience": "Не имеет значения"}, {"url": "https://www.superjob.ru/clients/bilajn-38260/vacancies.html", "salary": 0, "description": "Наша команда каждый день работает над повышением качества связи и отвечает за стабильный сервис для тебя. Профессионалы билайна уверенно создают надежную связь по всей территории нашей страны: в небольших поселках и крупных городах, на вершинах гор и под землей.\nЕсли ты готов решать сложные и масштабные задачи в команде экспертов — мы ждем твое резюме!\nИтак, тебе предстоит:\n• Удаленное администрирование оборудования связи сети ШПД;\n• Поддержка актуального программного обеспечения;\n• Проведение плановых и аварийных работ в рамках развития и эксплуатации сети ШПД;\n• Приемка объектов связи в эксплуатацию.\nМы будем рады рассмотреть твою кандидатуру, если у тебя есть:\n• Понимание: модели OSI, принципов работы коммутатора L2, принципов работы маршрутизаторов L3;\n• Наличие сертификатов: CCNA или аналогичный, CCNP или аналогичный;\n• Хороший уровень знаний в области видов архитектурных стандартов моделей сетей;\n• Базовые знания: Unix или Linux / базовые знания программирования - написание скриптов автоматизации (bash, perl, python);\n• Знания в области сетевой безопасности и разграничения доступа - чтение и формирование ACL;\n• Знания сетевых протоколов: RIP, OSPF, MPLS, STP, BGP, IGMP, PIM, SNMP.", "title": "Ведущий инженер", "area": "Ярославль", "experience": "От 1 года"}, {"url": "https://www.superjob.ru/clients/bank-vtb-235578/vacancies.html", "salary": 0, "description": "Мы ищем Аналитика воодушевленного своей работой, в стрим \"ВТБ PRO\". Наша команда занимается разработкой и развитием ВТБ PRO.\nВТБ PRO – фронт-система, в которой сотрудники (в первую очередь, в отделениях) обслуживают клиентов-физических лиц. В цели нашего стрима входит как улучшение пользовательского опыта сотрудника, так и оптимизация и развитие процессов обслуживания клиента. Поэтому мы ждем, именно тебя, если ты горишь тем, чем занимаешься, отвечаешь всем требованиям указанным ниже и готов развиваться в дружной команде профессионалов.\n \nОбязанности:\n \n• проведение анализа бизнес-процессов работы фронтального приложения для работы сотрудников розничного бизнеса;\n \n• формирование и проверка гипотез по оптимизации бизнес-процессов;\n \n• формирование бизнес-требований к командам разработки по оптимизации процессов;\n \n• разработка и оптимизация SQL-скриптов и проведение ad hoc аналитики на основании выгрузок;\n \n• формирование и тестирование гипотез, поиск зависимостей, в том числе статистическими методами;\n \n• формирование бизнес-требований к разработке витрин данных;\n \n• подготовка аналитической сводки для руководства.\n \nТребования:\n \n• обязательно – опыт работы от 2 лет на позициях, связанных с анализом бизнес-показателей/построением моделей и/или обработкой и анализом данных.\n \n• высшее образование по направлению прикладная математика/ИТ/статистика/экономика/бизнес-информатика;\n \n• знание Excel: сложные функции, сводные таблицы и графики, статистический анализ;\n \n• базовый уровень SQL (join, with, подзапросы);\n \n• высокий уровень аналитических способностей, умение идентифицировать важное среди потока информации, определять приоритеты, мыслить системно;\n \n• практический успешный опыт решений аналитических задач, построения и обоснования математических моделей;\n \n• высокий уровень коммуникативных навыков;\n \n• базовое понимание основных розничных банковских продуктов и процессов как преимущество;\n \n• опыт работы в любой из ключевых BI систем (Qlik, Tableau, Power BI);\n \n• опыт работы в области банковских розничных продуктов.\n \nУсловия:\n \n• трудоустройство согласно Законодательству;\n \n• конкурентная заработная плата;\n \n• профессиональное обучение и развитие;\n \n• добровольное медицинское страхование, льготные условия кредитования;\n \n• корпоративная пенсионная программа, материальная помощь;\n \n• спортивная жизнь и корпоративные мероприятия;\n \n• возможность построить карьеру в ведущем банке России.", "title": "Бизнес-аналитик (Управление ВТБ PRO)", "area": "Москва", "experience": "От 3 лет"}, {"url": "https://www.superjob.ru/clients/departament-gorodskogo-hozyajstva-4292976/vacancies.html", "salary": 60000, "description": "Обязанности:\n• Реализация алгоритмов и структур данных для решения задач\n• организации. Разработка веб-сервисов, системных утилит, систем\n• автоматизации. Осуществление технической поддержки сотрудников. \nТребования:\n• Высшее техническое образование. Уверенное знание и опыт\n• разработки на Python 3, JS, PostgreSQL. Опыт работы с Linux на уровне\n• администратора. \n• Знание современных информационных и сетевых технологий.\n• Готовность работать в режиме многозадачности. \nУсловия:\n• 40-часовая р/неделя, 8-часовой р/день, с 8.00 до 17.00, выходной - суббота, воскресенье\n• Удалённая работа не рассматривается", "title": "Программист", "area": "Коломна", "experience": "От 1 года"}, {"url": "https://www.superjob.ru/clients/alpinteh-723356/vacancies.html", "salary": 150000, "description": "Перечень задач:\n• Организация доступности информации для оперативного/тактического/стратегического управления. Проектирование и разработка витрин данных\n• Разработка аналитической отчетности.\n• Разработка дашбордов для оперативного и стратегического управления.\nУправленческие компетенции\n• Желательно:\n• Опыт управление проектом/ управление продуктом в областях:\n• Управленческая отчетность\n• Учетные системы\n• Витрины данных\n• BI системы\nТехнические компетенции\n• BI инструменты и инструменты подготовки данных\n• Python/Jupiter Notebook\n• Apache Airflow\n• Google Sheet + Apps Script\n• Excel\n• Системы для управления связками между сервисами (например N8N)\n• Базы данных\n• Математика на здоровом уровне\n• Эстетический вкус в визуализация и презентации данных\n• Способность задавать вопросы, структурировать и систематизировать.\nУсловия:\n\n• График работы с понедельника - по пятницу, с 8:00 - 17:00 (09:00 до 18:00)\n• Соблюдение трудового законодательства (официальное оформление с первого рабочего дня, \"белая\" заработная плата, оплачиваемые отпуска и больничные);\n• Стабильный рост заработной платы.\n• Корпоративные подарки от Компании на рождение ребенка, на 23 февраля. Новогодние подарки детям сотрудников.\n• Корпоративные скидки на нашу продукцию.", "title": "Аналитик", "area": "Москва", "experience": "От 3 лет"}, {"url": "https://www.superjob.ru/clients/mfti-2185844/vacancies.html", "salary": 100000, "description": "Обязанности:\n\n• Участие в разработке систем гиростабилизации подвижных объектов. \n• Разработка и реализация протоколов взаимодействия с контроллером управления систем гиростабилизации. \n• Написание программного кода для управления контроллером систем стабилизации. \n• Разработка ПО пользовательского интерфейса для ПЭВМ и одноплатных компьютеров типа Raspberry Pi. \n• Реализация взаимодействия с периферийными устройствами по стандартным интерфейсам (RS232, UART, RS485, SPI, I2C, Ethernet).\nТребования:\n\n• Высшее профессиональное (техническое) образование. \n• Знание С/С++, знание языка Python является плюсом.\n• Знание QT. \n• Опыт работы с микрокомпьютерами. \n• Знание ОС семейства Linux. \n• Понимание работы систем гиростабилизации. \n• Чтения принципиальных электрических схем и знание Altium Designer является плюсом.\nУсловия:\n\n• Работа в ведущем техническом вузе страны, в городе Долгопрудный (Рядом со станцией Новодачная МЦД-1, или 15 минут от метро Алтуфьево или Ховрино). \n• Оформление в соответствии с ТК РФ, официальная заработная плата. \n• Возможности профессионального развития. \n• Оплачиваемый отпуск, больничный лист. \n• График работы: 5/2, с 09:00 до 18:00, возможно работа в удаленном режиме. \n• Заработная плата: от 100 000 рублей. \n• Молодой активный коллектив. \n• Возможность бесплатного посещения бассейна и тренажерного зала. \n• В соответствии с ТК РФ (ст.331), работники сферы образования обязаны предоставить справку о наличии (отсутствии) судимости и (или) факта уголовного преследования, срок изготовления которой может быть до 30 дней, просим заранее позаботиться о её получении.", "title": "Инженер-программист", "area": "Москва", "experience": "От 3 лет"}, {"url": "https://www.superjob.ru/clients/centr-cifrovogo-razvitiya-4457373/vacancies.html", "salary": 0, "description": "Мы молодая, но уже известная на региональном рынке IT-компания. В нашей команде талантливые разработчики, креативные дизайнеры, опытные аналитики, ответственные менеджеры проектов. Результат нашей работы - активно используемые в государственном управлении информационные системы, отмеченные на всероссийских конкурсах \"ПРОФ-IT\" и \"ПРОФ-IT Инновация\". Разрабатываем с нуля, внедряем и сопровождаем сложные информационные системы. Вас ждёт широкий спектр интересных задач, позволяющих расти профессионально и реализовывать свои творческие амбиции.\n Ищем амбициозного руководителя группы разработки программного обеспечения (техлида) для работы в Красноярске от 30 лет,который будет отвечать за работу своей команды, качество, которое они производят, скорость и темп, с которыми они работают, но, что наиболее важно – за общий рост людей в ней. Важен опыт работы в данной сфере от 4-х лет/высшее профильное образование.\nМы используем:\n· Angular (Ionic);\n· HTML5, AJAX, CSS3, SASS;\n· TypeScript;\n· RxJS;\n· REST;\n· Python (Django)\n· Java Spring Boot\nПлюсом со стороны кандидата будет:\n· Наличие минимальных управленческих навыков;\n· Опыт работы с Docker, Kubernetes, Harbor;\n· Опыт в написании спецификаций OpenAPI;\n· Уверенное знание TypeScript;\n· Грамотное ведение Git репозитория\nМы ценим:\n· Стремление к росту;\n· Умение работать в команде, неконфликтность;\n· Умение доносить свою мысль;\n· Умение задавать тон (желание быть основой того, чего ожидают от остальной команды);\n· Внимание к деталям, мелочам;\n· Чувство юмора\nОбязанности:\n· Развивать командную экспертность;\n· Работать в команде c разработчиками, тестировщиками, дизайнерами;\n· Внедрять новые технологии, понимать, как эти технологии используются в рамках проектов;\n· Обеспечивать эффективные коммуникации между членами команды (разработчики, тестировщики, дизайнеры, аналитики);\n· Отвечать за результаты разработки продуктов;\n· Помогать переводу задач бизнеса в задачи, понятные разработчикам;\n· Работать над несколькими проектами параллельно;\n· Быть наставником группы разработки до 20 человек.\nМы предлагаем:\n· Официальное трудоустройство согласно ТК РФ;\n· Очную работу в офисе в центре города (пр. Мира) с доступом к любому виду транспорта;\n· График работы: пятидневная рабочая неделя с 9:00 до 18:00 или с 8:00 до 17:00;\n· Занятия английским 2 раза в неделю за счёт компании;\n· Официальное трудоустройство согласно ТК РФ;\n· Уровень “белой” з/пл. по результатам собеседования + премии;\n· Комфортные условия труда, оборудованная кухня, чай, кофе, дружный молодой коллектив;\n· ДМС за счёт компании;\n· Сопровождение наставника в роли начальника проектно-аналитического отдела на первых этапах работы;\n· Кафетерий льгот: обучение (накоплена обширная база курсов), спорт, отдых, туризм;\n· Возможность профессионального и карьерного роста;\n· Большие проекты краевого масштаба;\n· Развитую корпоративную культуру (мы проводим масштабные корпоративные мероприятия, дарим новогодние подарки детям, спортивные мероприятия, награждаем лучших сотрудников, поддерживаем в трудных жизненных ситуациях)\n\n\nПерспективы\nПрохождение курсов повышения квалификации за счёт компании, участие в различных семинарах, конференциях\nПорядок отклика\nДля рассмотрения вакансии, присылайте резюме и 2-3 свежие и лучшие работы по указанному электронному адресу.\nПосле получения резюме с Вами свяжутся и назначат время для прохождения собеседования в офисе нашей компании. Благодарим за проявленный интерес.", "title": "Руководитель группы разработки ПО (Техлид)", "area": "Красноярск", "experience": "От 3 лет"}, {"url": "https://www.superjob.ru/clients/tyumenskij-industrialnyj-universitet-2904704/vacancies.html", "salary": 25500, "description": "Обязанности:\n• Проведение лекционных и практических занятий\nТребования:\n• Высшее техническое образование АСОиУ, УИТС, АТС, АТП\n• Знание дисциплин: Системы искусственного интеллекта, Машинное обучение, Нейронные сети, Python, Теоретическая и прикладная информатика, Программирование. \nУсловия:\n• Официальное трудоустройство \n• Выплаты заработной платы 2 раза в месяц, без задержек\n• Гибкий график работы \n• Полная занятость ( 1 ст.) или Совместительство – 0,5 + почасовая \n• Заработная плата договорная - в зависимости от нагрузки", "title": "Старший преподаватель (кафедра математики и прикладных информационных технологий)", "area": "Тюмень", "experience": "Без опыта"}, {"url": "https://www.superjob.ru/clients/rossijskoe-obschestvo-znanie-4406959/vacancies.html", "salary": 180000, "description": "Российское общество «Знание» — крупнейшая в стране современная просветительская организация, которая ежегодно проводит сотни мероприятий для молодежи по всей России: организует тысячи выступлений выдающихся людей из сфер культуры, искусства, науки, истории, проводит научные баттлы, конкурсы, викторины, снимает фильмы и помогает лекторам в нашей стране быть услышанными и найти свою аудиторию.\nКоманда Технического департамента в поиске сильных Python (django) разработчиков для работы над новой контент-платформой.\nПроект имеет всероссийский масштаб, рассчитан на миллиоys пользователей и должен тесно связывать онлайн с офлайном. Включает в себя веб, мобильные приложения и множество спецпроектов.\nУ нас боевая команда из бизнеса, которая запускала такие продукты как Фоксфорд/Нетология и My Games Cloud\nТвоя основная задача будет заключаться в разработке серверной части приложений: клиентское API для веб и мобильных приложений.\nЧто мы ждем от кандидата:\n• Очень важен опыт разработки на Python 3 (Django Framework) от 3-х лет;\n• Опыт работы с PostgreSQL, Redis, Elasticsearch, DRF, Git;\n• Знание Celery, Docker;\n• Опыт работы с высоконагруженной архитектурой;\n• Умение писать поддерживаемый и расширяемый код (SOLID, KISS, DRY, паттерны и т.п.);\n• Умение и желание писать тесты, мы используем pytest.\nБудет преимуществом:\n• Опыт работы с k8s и облачными провайдерами;\n• Опыт разработки GraphQL API (graphene);\n• Asyncio, Aiohttp, Clickhouse, Kafka.\nЧто мы предлагаем:\n• Возможность присоединиться к проекту на старте: минимум легаси, максимум актуальных решений;\n• Полностью белую зп, оформление по ТК, современную технику для комфортной работы;\n• Удаленная работа с возможностью, при желании, посещать офис в Москве (м.Добрынинская);\n• Профессиональный и драйвовый коллектив;\n• Возможность влиять на процессы и практики компании через внедрение итеративных улучшений.", "title": "Python-разработчик (Django)", "area": "Москва", "experience": "От 3 лет"}, {"url": "https://www.superjob.ru/clients/udachnyj-vybor-2688238/vacancies.html", "salary": 200000, "description": "О нас:\nМы являемся аккредитованной IT-Компанией, агрегатор служб курьерской доставки, лидер в корпоративном сегменте рынка. Наши партнеры — известные курьерские службы и транспортные Компании, такие как Pony Express, СДЭК, DHL, Деловые Линии, КСЕ и т.д. (всего 18 компаний). Сотрудничая с нами, бизнес экономит до 40% при отправке документов и грузов по России, ближнему и дальнему зарубежью.\nО компании и ИТ-продуктах также см. ниже.\n\nРассматриваем варианты как офисной, так и удаленной занятости на полный рабочий день.\nОбязанности:\n• Развитие собственного in-house продукта, передового интернет-сервиса;\n• Проектирование программных решений, интеграций, API;\n• Разработка нового функционала на Python / Django;\n• Рефакторинг текущей кодовой базы, проведение ревью;\n• Поиск ошибок, их устранение;\n• Разработка интеграций с различными внешними системами;\n• Оптимизация сервисов под высокие нагрузки.\nТребования:\n• Python 3, Django, Django-rest;\n• Опыт проектирования и развития высоконагруженных систем;\n• Опыт работы с MySQL / Postgres;\n• Опыт работы c redis / rabbitmq;\n• Опыт работы с docker / docker-compose;\n• Опыт работы с celery;\n• Unit testing;\n• Умение разбираться в чужом коде;\n• Понимание работы http, https. REST, RESTful, SOAP;\n• git на уровне очень уверенного пользователя;\n• Уверенное знание Linux;\n• Знание английского на уровне В1 либо выше является обязательным!\nУсловия:\n• Официальное оформление.\n• Своевременная выплата зарплаты.\n• Офис: м. Павелецкая (5-10 минут пешком от метро), возможность работать удаленно.\n• График работы (по Москве): 5/2 с 9.00 до 18.00 (обсуждаемо).\n• Профессиональная команда единомышленников.\n• Открытость руководства к изменениям и улучшениям, без бюрократии.\n• Отлаженные процессы разработки ПО.\n• Возможность прокачать английский язык.\nО продукте и Компании:\nКатапульто — это передовой интернет-сервис, агрегатор служб курьерской доставки. Компания работает более 8 лет, является резидентом Сколково.\nМы развиваем собственный in-house продукт, которым пользуются тысячи компаний ежедневно.\nОб ИТ-подразделении:\nМы выстраиваем нашу Software Factory таким образом, чтобы максимально быстро и качественно решать коммерческие задачи за счет реализации передовых ИТ-решений.\nРаботаем с актуальным стеком технологий, не боимся пробовать новое и применять свежие решения.", "title": "Старший программист-разработчик (Python/Django) / Senior back-end developer", "area": "Москва", "experience": "От 6 лет"}, {"url": "https://www.superjob.ru/clients/k-telekom-4474113/vacancies.html", "salary": 19500, "description": "Вы еще не знаете о нас? Тогда немного о нашей Компании…\nКомпания «К Телеком» работает на телекоммуникационном рынке уже 15-ый год, мы предоставляем свои услуги в более чем 120 городах Свердловской, Челябинской областях и Пермском крае. Более 150 000 абонентов пользуются нашими услугами.\nЧто будет входить в круг Ваших обязанностей?\n• \nПроектирование электрических схем и плат устройств;\n• \nПрограммирование устройств;\n• \nНаписание системы управления устройствами и их Web-интерфейсов;\nЧто мы ждем от кандидата?\n• \nПонимание TCP/IP;\n• \nЗнание Python, С++;\n• \nЖелание работать и зарабатывать, расти и развиваться!\nПочему именно МЫ?\nРаботая в нашей компании, Вы получаете:\n• Официальное трудоустройство согласно ТК РФ;\n• Стабильный доход (окладно-премиальная система) все выплаты официальные;\n• Гибкий график работы, позволяющий совмещать работу и обучение, с перспективой перехода на полный рабочий день;\n• Надбавки за стаж от 1 года;\n• Работа в молодой, дружной, амбициозной, динамично развивающейся компании;\n• Внутрикорпоративное обучение + возможность внешнего обучения;\n• Перспективы профессионального и карьерного роста;\n• Возможность реализации своих идей.\nМы заботимся о наших сотрудниках, предоставляя:\n• Выплату материальной помощи по случаю рождения детей;\n• Новогодние подарки детям сотрудников на Новый год;\n• Корпоративные и спортивные мероприятия, сплавы;\n• Оплату предварительных и периодических медицинских осмотров;\n• Частичную компенсацию питания;\n• Корпоративный фитнес.\nГде Вы будете работать?\nВ современном комфортабельном офисе в Пионерском районе (ост. \"Современник\")\nМы создали уютный современный офис, комфортное рабочее место, лаунж-зону, кофе-бар, обеденную зону.\nТакже на территории офиса имеется бесплатная охраняемая парковка.\nПокоряй новые вершины в Компании К Телеком!\nОткрывай новые возможности и развивайся в успешной команде!", "title": "Инженер/Программист микроконтроллеров (стажер)", "area": "Екатеринбург", "experience": "Без опыта"}, {"url": "https://www.superjob.ru/clients/fgbu-nmic-onkologii-im-n-n-petrova-minzdrava-rossii-732413/vacancies.html", "salary": 300000, "description": "ФГБУ \"НМИЦ онкологии им. Н.Н. Петрова\" Минздрава России является одним из ведущих учреждений специализирующихся на оказание медицинской помощи по профилю \"онкология\". Учреждение имеет обширную базу исследований: лучевых методов диагностики, морфологии, а также большое количество медицинских данных пациентов с онкологическими заболеваниями. В настоящее время организация ищет руководителя лаборатории специализирующейся на разработки алгоритмов машинного обучения и искусственного интеллекта\nМы ищем руководителя DS команды для развития нескольких направлений\n* Компьютерное зрение - разработка систем по распознаванию информации: КТ снимки, маммографии, флюорографии легких и пр\n* LLM - создание помощников врача для онкологических пациентов. Взаимодействие с медицинскими информационными системами. Разработка систем принятия врачебных решений\n* Взаимодействие с носимой электроникой - анализ активности пациентов для определения риска развития осложнений\n* Разработка аналитической системы учреждения - прогноз потребности в медицинской помощи, расчет нагрузки оборудования, расчет рисков развития возникновения осложнений при оказания медицинской помощи\nЧем предстоит заниматься\n* Создание и руководство лабораторией DS (5 - 10 человек)\n* Развитие команды, управление эффективностью и качеством ее работы\n* Разработка и внедрение алгоритмов машинного обучения для повышения эффективности оказания медицинской помощи\n* Работа с метриками Машинного Обучения (Machine Learning), их сопоставление с бизнес-метриками Медицинской организации\n* В перспективе применение LLM (Больших Языковых Моделей) моделей для работы с медицинскими данными\nОсновные требования\n* Уверенный опыт работы в ML-направлении на позиции Senior/Lead, опыт управления командой DS приветствуется\n* Хорошие знания и опыт практического применения теории вероятностей и математической статистики \n* Знание основных алгоритмов и методов машинного обучение и анализа данных: линейные модели, ансамблевые методы, анализ и прогнозирование временных рядов (задачи классического Машинного Обучения)\n* Знание и опыт в области Глубокого Обучения (Deep Learning): сверточные нейронные сети (CNN); архитектуры для сегментации изображения - U-Net, Mask R-CNN, SAM; Трансформеры\n* Знание других архитектур (например, рекуррентные нейронные сети - RNN, LSTM) будет Вашим преимуществом\n* Опыт разработки ML-Конвейеров (Pipeline) на языках Python\n* Знание основного инструментария стека Python: Jupyter, Pandas, Scikit-learn, PyTorch/Tensorflow\n* Опыт работы с базами данных, владение языком запросов SQL;\n* Опыт внедрения корпоративных моделей данных, развития инструментов и систем для работы с данными\n* Развитые навыки коммуникации, способность быстро погружаться в специфику здравоохранения\n* Структурное мышление и умение излагать свои мысли\n* Опыт работы в сфере здравоохранения над проектами по ML и AI будет преимуществом\n- Знания английского языка будет Вашим преимуществом\nСтек\n* Разработка: Python, GitLab/GitHub, Docker, Kubernetes, AirFlow\n* Данные: Hadoop, PostgreSQL, Apache Airflow\nМы предлагаем\n* Трудоустройство в соответствии с ТК РФ\n* Белая зарплата\n* Возможность разрабатывать продукты востребованные для системы здравоохранения, которые позволяют повысить качество оказания медицинской помощи по профилю \"онкология\"\n* Возможность участвовать с презентацией проектов на профильных конференциях \n\n\nПросьба откликаться на вакансию полным резюме. В случае положительного результата рассмотрения резюме, Вы получите приглашение на интервью.", "title": "Senior data scientist", "area": "Санкт-Петербург", "experience": "От 1 года"}, {"url": "https://www.superjob.ru/clients/tehtob-4478362/vacancies.html", "salary": 80000, "description": "Обязанности:\n\nМы ищем специалиста, способного дополнить команду работающую над разработкой продукта связанного с AI / LLM моделями.\nНаша команда состоит из профессионалов, которые успешно получили стартап-пермит в Силиконовой долине, мы создаем продукты на основе LLM. В данный момент мы нацелены на создание интерактивного помощника, обучаемый инструмент для повседневного участия в работе человека и приложения.\nЧто нужно будет делать в рамках команды:\n• Проектировать, разрабатывать и внедрять новый продуктовый функционал решений, интеграций, API;\n• Разработка нового функционала на Python / Django (или С#, C++), приветствуется иметь навыки написания кода на других языках программирования;\n• Разработка программного обеспечения на базе СУБД PostgreSQL;\n• Подготовка данных для обучения и тестирования моделей;\n• Поиск точек роста, узких мест, нахождение путей улучшения качества моделей за счет данных;\n• Предобработка, фильтрация и сегментация данных;\n• Выстраивание архитектуры и написание пайплайнов разметки данных;\n• Проводить тестирование и оптимизацию текущих моделей, работа с метриками;\n• Оптимизировать существующие решения, в т.ч. архитектурные с точки зрения производительности и надежности;\n• Довести качество до ChatGPT, помогать решать бизнес задачи приложения с помощью нашей технологии;\n• Участие в эксплуатации и развитии ИТ-инфраструктуры организации;\n• Заниматься непрерывным обменом знаниями со всей командой разработчиков;\n• Регулярное проведение knowledge sharing sessions является частью нашей культуры;\n• Регулярное проведение статус отчетов (Вторник, Четверг 20:00 - 21:00 мск);\n• Решение задач в режиме стартапа, ответственность за результат;\n• Анализ и оптимизация существующего кода;\n• Рефакторинг текущей кодовой базы, проведение ревью;\n• Поиск ошибок, их устранение;\n• Разработка интеграций с различными внешними системами;\n• Оптимизация сервисов под высокие нагрузки;\n• Работа с ОС Linux (CentOS, openSUSE и др.), Asta linux, Windows (7,10,11, server 2012 – 2019);\nБыть гибким в мышлении, трудолюбивым, жить своим делом. Быть честным и преданным. Не лениться, не быть гордым, быть компромиссным и вежливым, терпеливым. Обеспечить высочайшее качество взаимодействия, выполнять все оперативно. Принимать достойно критику, стараться подстроиться и быть словно единым целым с этим делом.\nТребования:\nВысшее техническое или неоконченное высшее образование (профильное);\n• Опыт коммерческой разработки клиент-серверных приложений;\n• Понимание ООП/GoF/SOLID;\n• Понимание Natural Language Processing (NLP) , знакомство с LangChain и Large Language Model (LLM) , а также базовый Elastic Search будет плюсом;\n• Опыт работы с RESTful API, интеграция с внешними сервисами;\n• Знание основ работы с базами данных, опыт работы с PostgreSQL или MySQL;\n• Понимание принципов работы машинного обучения, опыт работы с TensorFlow, Keras или PyTorch будет преимуществом;\n• Отличное знание Python 3, библиотек для разработки API и работы с данными (FastAPI, Pandas, Numpy, SQL Alchemy, asyncio);\n• Отличное знание подходов CI/CD и их реализации на GitLab;\n• Отличное знание PostgreSQL;\n• Уверенное знание .NET, C#;\n• Опыт построения решений в микросервисной архитектуре;\n• Работа по задачам с высокой степенью неопределенности;\n• Опыт постановки задач и сбора требований напрямую от заказчика, без детальной проработки у аналитика. Желание самому предлагать идеи реализации и проявлять инициативу в целом;\n• Умение работать с системами управления версиями (Git), таск-трекинга;\n• Умение писать качественные комментарии;\n• Опыт разработки нагруженных многопользовательских систем;\n• Опыт работы с данными и алгоритмами, отличное знание SQL, Pandas, FastAPI;\n• Понимание Deep learning (DL), опыт обучения просто моделей и больших моделей;\n• Участие в проектировании архитектуры, выработке решений по отказоустойчивости и производительности;\n• Разработка нового и доработка существующего back-end и front-end функционала;\n• Ответственность, дисциплинированность, стрессоустойчивость;\n• Читать техническую документацию на английском языке;\nЖелательно:\nУмение разбираться в чужом коде;\n• Понимание работы http, https. REST, RESTful, SOAP;\n• Опыт работы с highload-сервисами;\n• Опыт работы с ClickHouse, Pinecone;\n• Опыт работы с Flask;\n• Опыт docker/kubernetes, docker-compose;\n• Опыт создания проектов с \"0\";\n• Опыт/понимание математики и геометрии и алгоритмов связанных с математикой и геометрией;\n• Опыт проектирования и развития высоконагруженных систем;\n• Опыт работы с MySQL / Postgres;\n• Опыт работы c redis / rabbitmq;\n• Опыт управление командой разработчиков;\n• Желание много работать и учиться;\n• Разговаривать на английском языке;\n\nУсловия:\nДистанционное взаимодействие (как минимум первые 6 месяцев). Вы работаете у себя дома;\n• Доступно соискателям с инвалидностью;\n• Достойная заработная плата по результатам собеседования в зависимости от опыта и навыков;\n• Возможно оформление: договор услуг, подряда, ГПХ, самозанятые, ИП;\n• Возможна полная занятость 5/2 8 часов (график обсуждаетсяс учётом Ваших пожеланий);\n• Возможна подработка: сменами по 4-6 часов или по вечерам;\n• Своевременная выплата зарплаты;\n• Профессиональная команда единомышленников;\n• Открытость руководства к изменениям и улучшениям, без бюрократии;\nРаботая с нами, ты:\n\n• Обогатишь свой опыт участия в разработке и запуске приложений/сервисов от идеи до вывода на рынок;\n• Обретёшь профессиональная команду единомышленников;\n• Сможешь работать, не выходя из дома;\n• Станешь созидателем проекта мирового масштаба;\n• Прокачаешь английский язык;\n• Получаешь возможности карьерного роста (Компания постоянно развивается и растёт);\nНа данном этапе мы создаем юридическое приложение и нам важно найти специалиста, который занимался системами обработки текстовой информации, интересуется машинным обучением и способен применять существующие модели, а в перспективе стать ключевым игроком в продуктовой и технической реализации проекта.\nУважаемые соискатели, просьба указывать ожидаемый уровень З/П на руки в сопроводительном письме!", "title": "Программист Бэкенд AI", "area": "Москва", "experience": "От 1 года"}, {"url": "https://www.superjob.ru/clients/gou-spo-kolledzh-svyazi-167366/vacancies.html", "salary": 85000, "description": "Обязанности:\n• \nПроведение занятий по учебным предметам, курсам, дисциплинам (модулям) образовательной программы в соответствии с расписанием учебных занятий. Разработка и обновление рабочих программ учебных предметов, курсов, дисциплин (модулей) и т.д. Планирование, в соответствии с локальными актами колледжа, занятий по учебным предметам, курсам, дисциплинам (модулям) программ. Ведение документации. Выполнение должностных обязанностей в соответствии с требованиями безопасности.\n \nПреподавание следующих дисциплин:\n \nОП.04 Основы алгоритмизации и программирования\n \nМДК.05.01 Проектирование и дизайн информационных систем\n \nОП.04 Основы алгоритмизации и программирования\n \nМДК.01.01 Разработка программных модулей\n \nМДК.01.02 Поддержка и тестирование программных модулей\n \nМДК.01.03 Разработка мобильных приложений \n \nМДК.01.03 Разработка мобильных приложений \n \nМДК.02.01 Технология разработки программного обеспечения \n \nМДК.01.01 Разработка программных модулей\n \nМДК.01.03 Разработка мобильных приложений\n \nТребования:\n• \nВладение математическим аппаратом, алгеброй логики.\n• \n Знание/понимание алгоритмов и языков программирования (C#, C++, JS, PHP, Python — уровень выше среднего).\n• Знание методов программирования (процедурный и ООП) \nУсловия:\n• Опыт преподавательской деятельности", "title": "Преподаватель спецдисциплин (информационные системы и программирование)", "area": "Москва", "experience": "От 3 лет"}, {"url": "https://www.superjob.ru/clients/gbou-licej-126-kalininskogo-rajona-sankt-peterburga-2295752/vacancies.html", "salary": 30000, "description": "Примечание:\n• с 1 сентября 2022 на базе Лицея 126 открыт Центр цифрового образования \"ИнфинITи\", в который требуются методист по программированию на различных языках (Python обязательно)\nОбязанности:\n• Методическое сопровождение мероприятий центра по направлению \"Программирование на Python \").\n• Поиск и внедрение в план работы педагогов внешних конкурсов и мероприятий технической направленности. \n• Составление программ дополнительного образования.\n• Взаимодействие с внешними партнерами центра.\n• Методическое сопровождение педагогов центра\nТребования:.\n• Ответственность \n• Грамотность \n• Уверенное владение ПК\n• Отсутствие вредных привычек\nУсловия:\n• Рабочий день с 11:00\n• Официальное трудоустройство\n• Соцпакет\n• Бассейн\n• Оплачиваемый отпуск летом 56 дней\n• Возможность внутреннего совмещения по должности администратор, или педагог дополнительного образования", "title": "Методист по программированию на Python (в центр цифрового образования)", "area": "Санкт-Петербург", "experience": "От 1 года"}, {"url": "https://www.superjob.ru/clients/shkola-760-im-a-p-mareseva-4233780/vacancies.html", "salary": 80000, "description": "Обязанности:\n\nПреподавание учебных дисциплин, организация учебной деятельности обучающихся по освоению учебных дисциплин; педагогический контроль и оценка освоения образовательной программы в процессе промежуточной и итоговой аттестации; разработка программно-методического обеспечения учебных дисциплин.\nТребования:\nРезультат прохождения предметного тренинга МЦКО в формате ЕГЭ не ниже высокого уровня;\nНаличие справки об отсутствии судимости;\nЖелательно высшее профессиональное образование (бакалавриат, специалитет, магистратура);\nНавыки работы с робототехникой; с языками программирования (в т.ч. язык КуМир, Python).\nЖелательно обладать компетенциями в области искусственного интеллекта / работы с большими данными / технологий связи / информационной безопасности.\nУсловия:\n• Оформление по ТК РФ;\n• Стабильная заработная плата;\n• Школа является участницей городского проекта \"IT-Вертикаль\", \"ИТ-класс в московской школе\";\n• Пешая доступность от платформы \"Лось\", м. ВДНХ.", "title": "Учитель информатики и робототехники", "area": "Москва", "experience": "От 1 года"}, {"url": "https://www.superjob.ru/clients/spb-gb-pou-radiotehnicheskij-kolledzh-2167116/vacancies.html", "salary": 60000, "description": "Дисциплины:\n1.Основы алгоритмизации и программирования\n2. Разработка модулей программного обеспечения для компьютерных систем\n3. Системное программирование.\n4.Поддержка и тестирование программных модулей.\n5.Основы администрирования баз данных\nОбязанности:\n\nПроведение теоретических занятий, практических и лабораторных работ, урок учебной практики. Разработка учебно-методического комплекса по проводимым занятиям. Оформление отчетной документации по результатам проведенных занятий\n\nНеобходимые знания:\nПоддержка и тестирование программных модулей. Системное программирование. \n- Работа с GIT.\n- Знание C++, C# (.NET) \n- Знание Python и MSSQL \n - Знание основ баз данных. \n\nТребования: Высшее профессиональное образование.\n\nСправка об отсутствии судимости, ЛМК, сертификат прививок.\n\nУсловия:\n\n• Трудоустройство согласно ТК РФ, полный соцпакет. Работа согласно расписанию занятий и учебному плану.", "title": "Преподаватель Информатика и вычислительная техника", "area": "Санкт-Петербург", "experience": "От 1 года"}, {"url": "https://www.superjob.ru/clients/superjob-14449/vacancies.html", "salary": 0, "description": "SuperJob — это инновационная IT-компания, которая помогает соискателям найти работу, а работодателям — приобрести ценного сотрудника.\nЕжемесячно нашим сервисом пользуются миллионы соискателей и десятки тысяч работодателей, среди которых РЖД, Мегафон, МТС, Леруа Мерлен, Почта России, Сбербанк, Альфа-Банк, Ригла и многие другие. Мы активно развиваем нашу платформу и делаем ее лучше, подтверждая миссию «Работа должна доставлять удовольствие!»\nВам предстоит:\n• Собирать, анализировать и консолидировать данные по продажам.\n• Работать с большими объемами данных.\n• Анализировать маркетинговые активности.\n• Работать с сегментацией клиентов.\n• Ежедневно контролировать ключевые показатели. \n• Тестировать гипотезы по улучшению метрик, проводить А/Б тесты и интерпретировать их результаты. \n• Анализировать причинно-следственную связь метрик с основными бизнес-процессами компании. Давать рекомендации по их улучшению.\nОт своего будущего коллеги мы ждем:\n• Продвинутого уровня использования Google analytics, Яндекс.Метрик.\n• Опыта работы в любой BI-системе (у нас Tableau).\n• Хорошего знания Excel.\n• Знания SQL (навыки написания сложных запросов, знание оконных функций).\n• Опыта работы с Python.\nСвоему будущему коллеге мы предлагаем:\n• Работу в одном из самых быстрорастущих рынков - HRTech.\n• Непрерывное профессиональное развитие внутри компании.\n• Возможность стать частью сплоченной команды, любящей свое дело.\n• Официальную заработную плату.\n• Современный офис в 10 минутах пешей прогулки от станций метро Пушкинская/Маяковская/Чеховская/Новослободская.\n• Спортивный уголок.\n• Комфортную зону отдыха.\n• Кофе-поинты с вкуснейшим кофе и вендинговым аппаратом.\n• Оборудованное просторное место для питания.\n• Оплату проезда общественным транспортом.", "title": "Аналитик отдела продаж", "area": "Москва", "experience": "От 3 лет"}, {"url": "https://www.superjob.ru/clients/gbou-shkola-489-660368/vacancies.html", "salary": 0, "description": "Проведение дополнительных занятий по одному или нескольким направлениям:\n• Юный физик (2-4 кл., 5-7 кл. с использованием конструкторов по физике)\n• Юный биолог ( 2-4 кл., 5-9 кл. с использованием лабораторного оборудования по биологии) \n• Химический практикум (4,5,6,7,8 кл. с использованием лабораторного оборудования по химии)\n• Экологический практикум (2-9 кл., с использованием лабораторного оборудования, цифровых лабораторий) \n• Робототехника (конструкторы Red, Trik, Интернет-вещей (Mgbot)\n• Программирование (Python)\n• 3D-моделирование (Компас, с использованием 3D-принтеров)\n• Нейротехнологии (с использованием учебного оборудования)\nОбязанности: \n• Осуществляет разнообразную развивающую деятельность обучающихся (воспитанников) в области дополнительного образования или внеурочной деятельности\n• Комплектует состав кружка, секции, студии, клубного объединения и других форм внеурочной работы с обучающимися и принимает меры по его сохранению в течение срока их работы.\n• Участвует в разработке и реализации образовательных программ, несет ответственность за качество их выполнения, жизнь и здоровье обучающихся.\n• Выявляет творческие способности обучающихся, способствует развитию их интересов и склонностей.\nТребования:\n• Умение или желание научиться работать с учебным и лабораторный оборудованием\n• Возможно магистранты ВУЗов по соответствующим профилям.\nУсловия:\n• Различные виды учебного оборудования", "title": "Педагог дополнительного образования", "area": "Санкт-Петербург", "experience": "Без опыта"}, {"url": "https://www.superjob.ru/clients/antikor-polimer-4483760/vacancies.html", "salary": 70000, "description": "Обязанности:\n• Администрирование IT-инфраструктуры компании.\n• Построение и поддержка отказоустойчивых систем.\n• Мониторинг инфраструктуры (сбор и анализ метрик, логирование, проактивный мониторинг).\n• Поддержка сервисов на базе продуктов Microsoft.\n• Автоматизация рутинных задач.\n• Ведение документации по обслуживаемым сервисам.\n• Помощь в обслуживании сотрудников компании (по заявкам).\nТребования:\n• Понимание работы основных сетевых сервисов DNS, DHCP, TFTP, NAT и т.д.;\n• Опыт работы с сетевыми сервисами от Microsoft: DNS, DHCP, DFS, WSUS;\n• Навыки работы с Active Directory – понимание структуры каталога, понимание принципов RBAC;\n• Навыки написания скриптов на PowerShell;\n• Администрирование и автоматизация обслуживания для:\n - Клиентских ОС MS Windows (8.1, 10);\n - Серверных ОС MS Windows Server (2016, 2019).\n• Опыт работы с Hyper-V и SCVMM;\n• Опыт работы с системами мониторинга;\n• Понимание принципов работы аппаратного обеспечения (серверов, ПК), умение произвести первичную диагностику оборудования;\n• Понимание принципов работы сетевого оборудования – решение базовых задач настройки маршрутизации/сетевого экрана/управляемых коммутаторов;\n• Знание принципов построения СКС;\n• Опыт обслуживания почтового сервера (желателен опыт работы с MS Exchange);\n• Базовые знание ОС семейства Linux;\n• Опыт работы с системами контроля версий;\n• Желателен опыт работы: с Asterisk; СУБД MS SQL Server / MySQL; CentOS; Pyhton;\n• Навыки подготовки технической документации.\nУсловия:\n• Работа в стабильно развивающейся группе компаний.\n• пятидневная рабочая неделя, с 9-00 до 18-00.\n• Оклад 70 000 + премия от 30 000 (вкл. НДФЛ).\n• Оформление в соответствии с ТК РФ (отпуск, б/л,+ дополнительные дни отпуска).\n• Сильная команда и возможность реализовать свой потенциал.\n• официально действует отсрочка от армии и бронь от мобилизации.\n• выплата з/п 2 раза в месяц.\n• возможность комбинированного режима работы.\n• территориально м. Беговая, Бизнес-Центр \"Атлантик-Сити\".", "title": "Системный администратор", "area": "Санкт-Петербург", "experience": "От 3 лет"}]