[{"url": "https://hh.ru/vacancy/83154274", "platform": "hh.ru", "salary": 17000000, "description": "\nТребования: Обязательные hard skills к кандидату: - MySQL/PostgreSQL. - REST API. - желательно умение писать unit/functional тесты. - понимание концепции Clean Code. \nОбязанности: разработка нового функционала. - рефакторинг кодовой базы. - написание тестов. - при необходимости улучшение структуры БД или ее расширение. - разработка веб-сервисов с...", "title": "Back End разработчик (PHP/Python/Go)", "area": "Ташкент", "experience": "От 3 до 6 лет"}, {"url": "https://www.superjob.ru/vakansii/starshij-programmist-razrabotchik-46663422.html", "platform": "superjob.ru", "salary": 200000, "description": "О нас:\nМы являемся аккредитованной IT-Компанией, агрегатор служб курьерской доставки, лидер в корпоративном сегменте рынка. Наши партнеры — известные курьерские службы и транспортные Компании, такие как Pony Express, СДЭК, DHL, Деловые Линии, КСЕ и т.д. (всего 18 компаний). Сотрудничая с нами, бизнес экономит до 40% при отправке документов и грузов по России, ближнему и дальнему зарубежью.\nО компании и ИТ-продуктах также см. ниже.\n\nРассматриваем варианты как офисной, так и удаленной занятости на полный рабочий день.\nОбязанности:\n• Развитие собственного in-house продукта, передового интернет-сервиса;\n• Проектирование программных решений, интеграций, API;\n• Разработка нового функционала на Python / Django;\n• Рефакторинг текущей кодовой базы, проведение ревью;\n• Поиск ошибок, их устранение;\n• Разработка интеграций с различными внешними системами;\n• Оптимизация сервисов под высокие нагрузки.\nТребования:\n• Python 3, Django, Django-rest;\n• Опыт проектирования и развития высоконагруженных систем;\n• Опыт работы с MySQL / Postgres;\n• Опыт работы c redis / rabbitmq;\n• Опыт работы с docker / docker-compose;\n• Опыт работы с celery;\n• Unit testing;\n• Умение разбираться в чужом коде;\n• Понимание работы http, https. REST, RESTful, SOAP;\n• git на уровне очень уверенного пользователя;\n• Уверенное знание Linux;\n• Знание английского на уровне В1 либо выше является обязательным!\nУсловия:\n• Официальное оформление.\n• Своевременная выплата зарплаты.\n• Офис: м. Павелецкая (5-10 минут пешком от метро), возможность работать удаленно.\n• График работы (по Москве): 5/2 с 9.00 до 18.00 (обсуждаемо).\n• Профессиональная команда единомышленников.\n• Открытость руководства к изменениям и улучшениям, без бюрократии.\n• Отлаженные процессы разработки ПО.\n• Возможность прокачать английский язык.\nО продукте и Компании:\nКатапульто — это передовой интернет-сервис, агрегатор служб курьерской доставки. Компания работает более 8 лет, является резидентом Сколково.\nМы развиваем собственный in-house продукт, которым пользуются тысячи компаний ежедневно.\nОб ИТ-подразделении:\nМы выстраиваем нашу Software Factory таким образом, чтобы максимально быстро и качественно решать коммерческие задачи за счет реализации передовых ИТ-решений.\nРаботаем с актуальным стеком технологий, не боимся пробовать новое и применять свежие решения.", "title": "Старший программист-разработчик (Python/Django) / Senior back-end developer", "area": "Москва", "experience": "От 6 лет"}, {"url": "https://www.superjob.ru/vakansii/python-razrabotchik-46640575.html", "platform": "superjob.ru", "salary": 180000, "description": "Российское общество «Знание» — крупнейшая в стране современная просветительская организация, которая ежегодно проводит сотни мероприятий для молодежи по всей России: организует тысячи выступлений выдающихся людей из сфер культуры, искусства, науки, истории, проводит научные баттлы, конкурсы, викторины, снимает фильмы и помогает лекторам в нашей стране быть услышанными и найти свою аудиторию.\nКоманда Технического департамента в поиске сильных Python (django) разработчиков для работы над новой контент-платформой.\nПроект имеет всероссийский масштаб, рассчитан на миллиоys пользователей и должен тесно связывать онлайн с офлайном. Включает в себя веб, мобильные приложения и множество спецпроектов.\nУ нас боевая команда из бизнеса, которая запускала такие продукты как Фоксфорд/Нетология и My Games Cloud\nТвоя основная задача будет заключаться в разработке серверной части приложений: клиентское API для веб и мобильных приложений.\nЧто мы ждем от кандидата:\n• Очень важен опыт разработки на Python 3 (Django Framework) от 3-х лет;\n• Опыт работы с PostgreSQL, Redis, Elasticsearch, DRF, Git;\n• Знание Celery, Docker;\n• Опыт работы с высоконагруженной архитектурой;\n• Умение писать поддерживаемый и расширяемый код (SOLID, KISS, DRY, паттерны и т.п.);\n• Умение и желание писать тесты, мы используем pytest.\nБудет преимуществом:\n• Опыт работы с k8s и облачными провайдерами;\n• Опыт разработки GraphQL API (graphene);\n• Asyncio, Aiohttp, Clickhouse, Kafka.\nЧто мы предлагаем:\n• Возможность присоединиться к проекту на старте: минимум легаси, максимум актуальных решений;\n• Полностью белую зп, оформление по ТК, современную технику для комфортной работы;\n• Удаленная работа с возможностью, при желании, посещать офис в Москве (м.Добрынинская);\n• Профессиональный и драйвовый коллектив;\n• Возможность влиять на процессы и практики компании через внедрение итеративных улучшений.", "title": "Python-разработчик (Django)", "area": "Москва", "experience": "От 3 лет"}, {"url": "https://dolgoprudniy.superjob.ru/vakansii/analitik-45733204.html", "platform": "superjob.ru", "salary": 150000, "description": "Перечень задач:\n• Организация доступности информации для оперативного/тактического/стратегического управления. Проектирование и разработка витрин данных\n• Разработка аналитической отчетности.\n• Разработка дашбордов для оперативного и стратегического управления.\nУправленческие компетенции:\n• Желательно:\n• Опыт управление проектом/ управление продуктом в областях:\n• Управленческая отчетность\n• Учетные системы\n• Витрины данных\n• BI системы\nТехнические компетенции:\n• BI инструменты и инструменты подготовки данных\n• Python/Jupiter Notebook\n• Apache Airflow\n• Google Sheet + Apps Script\n• Excel\n• Системы для управления связками между сервисами (например N8N)\n• Базы данных\n• Математика на здоровом уровне\n• Эстетический вкус в визуализация и презентации данных\n• Способность задавать вопросы, структурировать и систематизировать.\nУсловия:\n\n• График работы с понедельника - по пятницу, с 8:00 - 17:00 (09:00 до 18:00)\n• Соблюдение трудового законодательства (официальное оформление с первого рабочего дня, \"белая\" заработная плата, оплачиваемые отпуска и больничные);\n• Стабильный рост заработной платы.\n• Корпоративные подарки от Компании на рождение ребенка, на 23 февраля. Новогодние подарки детям сотрудников.\n• Корпоративные скидки на нашу продукцию.", "title": "Аналитик", "area": "Долгопрудный", "experience": "От 3 лет"}, {"url": "https://www.superjob.ru/vakansii/inzhener-programmist-45695694.html", "platform": "superjob.ru", "salary": 125000, "description": "Обязанности:\n• Разработка встроенного ПО для микроконтроллерных систем со стандартными и нестандартными процессорными ядрами;\n• Настройка среды разработки под изменения внутренней структуры микроконтроллерной системы (изменение количества и/или функционального назначения интерфейсных блоков и внутренних блоков системы и т.п.);\n• Разработка математических моделей и эмуляторов разрабатываемых IP-блоков микроконтроллерной систем;\n• Разработка тестов для выполнения функционального моделирования разрабатываемых микроконтроллерных систем и их составных частей;\n• Разработка документации на разработанное ПО;\n\nТребования:\n• Навыки программирования микроконтроллеров (языки С/С++, Python, TCL), знание периферийных интерфейсов (UART, I2C, SPI, CAN, SDIO, USB, MIPI, SATA и т.д.);\n• Опыт работы в средах проектирования Eclipse, Keil и пр., а также их настройки при изменении конфигурации микроконтроллерной системы, опыт создания HAL библиотек;\n• Навыки отладки микроконтроллерных систем с использованием GDB, OpenOCD и пр. Также настройка их ( GDB, OpenOCD) конфигурации под разрабатываемую микроконтроллерную систему;\n• Навыки работы в среде ОС Linux, Windows, с системами контроля версий;\n• Английский язык — чтение технической документации, ведение переписки;\nУсловия:\n• Оформление согласно ТК РФ;\n• Инновационные проекты;\n• Зарубежные командировки: тренинги, партнеры;\n• Премии согласно выполненным задачам;\n• Гибкий график\n• R&D центр г. Москва, ст. м. Тушинская (6 мин. пешком от метро)", "title": "Инженер-программист", "area": "Москва", "experience": "От 6 лет"}, {"url": "https://hh.ru/vacancy/83111013", "platform": "hh.ru", "salary": 110000, "description": "\nТребования: Опыт работы с JavaScript, React. Опыт вёрстки компонентов (HTML, CSS). Понимание принципов сетевого взаимодействия. Понимание работы протокола HTTP. \nОбязанности: Разработка React-компонентов и SPA. Поддержка существующих проектов. Тестирование и оптимизация создаваемых продуктов. Взаимодействие с командой разработчиков в компании и...", "title": "Frontend-разработчик", "area": "Санкт-Петербург", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/83041941", "platform": "hh.ru", "salary": 100000, "description": "\nТребования: Требуемый опыт работы: опыт в программировании на <highlighttext>Python</highlighttext>. Ключевые навыки: <highlighttext>Python</highlighttext>, Linux, MySQL, Apache HTTP Server, SQL, Flask.\nОбязанности: Разработка отдельных модулей программных комплексов. Доработка созданного ранее ПО.", "title": "Python-разработчик / Junior Python Developer", "area": "Нижний Новгород", "experience": "От 1 года до 3 лет"}, {"url": "https://www.superjob.ru/vakansii/analitik-informacionnoj-bezopasnosti-soc-l2-middle-soc-analyst-l2-46547022.html", "platform": "superjob.ru", "salary": 100000, "description": "Обязанности:\n \n• Мониторинг и анализ событий информационной безопасности от различных источников в SIEM системе / Threat Hunting платформе;\n \n• Выполнение роли выделенного клиентского аналитика 2-ой линии Центра мониторинга и реагирования на киберугрозы;\n \n• Адаптация сценариев выявления инцидентов в SIEM системе / Threat Hunting платформе под особенности инфраструктур клиентов;\n \n• Фильтрация ложных срабатываний сценариев выявления инцидентов в используемой SIEM системе / Threat Hunting платформе;\n \n• Реагирование и оповещение заказчиков об инцидентах ИБ в соответствии с установленным SLA;\n \n• Расследование типовых и нетиповых инцидентов ИБ, подготовка рекомендаций для заказчиков по инцидентам ИБ;\n \n• Работа с EDR решением: написание правил, расследование инцидентов;\n \n• Проведение работ по практической оценке защищённости Ит инфраструктуры;\n \n• Взаимодействие с заказчиками по вопросам реагирования на инциденты ИБ;\n \n• Разработка планов реагирования на инциденты ИБ (playbook-и);\n \n• Участие в разработке новых сценариев выявления инцидентов в SIEM / Threat Hunting платформе;\n \n• Наставничество над группой аналитиков 1-ой линии.\n \nТребования:\n \n• Высшее техническое образование;\n \n• Знание сетевых технологий (в объеме сертификации CCNA);\n \n• Знание операционных систем Windows/Linux на уровне администратора;\n \n• Уверенное знание современных тактик и техник атакующих, основных векторов атак на корпоративные инфраструктуры, способов их обнаружения и противодействия;\n \n• Понимание классификации современного вредоносного ПО;\n \n• Опыт работы с SIEM системами (желательно ELK стэк);\n \n• Опыт работы с СЗИ – IDS\\WAF\\NGFW\\AV\\EDR;\n \n• Опыт анализа логов от различных систем, умение их правильно интерпретировать;\n \n• Будет дополнительным преимуществом: опыт программирования на Python/Go для автоматизации рутинных задач;\n \n• Будет дополнительным преимуществом: наличие профильных сертификаций (SANS, Offensive Security, eLearnSecurity, EC-Council).\n \nУсловия:\n \n• Оформление по ТК РФ;\n \n• Полная занятость;\n \n• Возможность профессионального и карьерного роста;\n \n• Заработная плата по результатам собеседования.", "title": "Аналитик информационной безопасности SOC L2 Middle soc analyst L2", "area": "Москва", "experience": "От 1 года"}, {"url": "https://spb.superjob.ru/vakansii/web-razrabotchik-41964533.html", "platform": "superjob.ru", "salary": 100000, "description": "Ищем талантливого Backend разработчика с опытом работы на коммерческих проектах, который станет частью команды разработки портала EuroAuto и других проектов компании.\nИспользуемый стек технологий:\n- PHP 7.4 (Silex, Kohana, Laravel, Symfony);\n- Шаблонизатор Twig;\n- Python;\n- NoSQL: Redis, Memcached;\n- PostgreSQL, MSSQL;\n- CI/CD;\n- Docker/Kubernetes;\n- GitLab/Kibana;\n- JS, TypeScript, ReactJS, jQuery;\n- Bootstrap3/5, Webpack ,SASS/SCSS/CSS.\nЧем предстоит заниматься:\n- Разработка и сопровождение новых фич;\n- Поддержка и рефакторинг ранее разработанного функционала;\n- Решение проблем и оптимизация производительности;\n- Участвовать в проектировании и принятии архитектурных решений;\n- Взаимодействовать с фронт-разработчиками, тестировщиками и бизнесом.\nТребования:\n- Уверенные знания PHP7, опыт веб-разработки не менее 3-х лет;\n- Опыт работы с фреймворками Laravel или Symfony от 1 года;\n- Понимание ООП и паттернов проектирования, умение их применять;\n- Знание SQL на уровне написания запросов средней сложности;\n- Опыт работы с REST API, понимание протокола HTTP;\n- Опыт работы в команде с использованием Git;\n- Умение разбираться в чужом коде.\nПожелания:\n- Опыт создания высоконагруженных проектов;\n- Умение декомпозировать задачи и доводить их до конца;\n- Опыт использования docker для локальной разработки (Nginx+php-fpm);\n- Вы достаточно самостоятельны, чтобы разобраться в устройстве процесса, системы;\n- Вы достаточно внимательны и напишите в сопроводительном письме в какой версии php появилась функция is_countable();\n- Опыт использования PHPUnit.\nПреимущества:\n• Официальное трудоустройство и достойная заработная плата;\n• Гибридный график работы - 3 дня в офисе (понедельник-среда и четверг пятница-удаленная работа), начинаем работу в гибком графике - с 8 до 10;\n• Свободный dress code;\n• Комфортный офис в шаговой доступности от м. Петроградская/Чкаловская;\n• Чай, кофе, печеньки, обеды за счёт компании;\n• Комфортный темп разработки;\n• Возможность обучаться за счёт компании, возможность профессионального роста;\n• Скидка на покупку деталей и ремонт автомобиля в сервисах ЕвроАвто;\n• Корпоративные подарки для детей и взрослых;\n• Корпоративный футбол;\n• Участие в крупном проекте по развитию web – направления сети;\n• Возможность выбора направления работы.", "title": "Web-разработчик (backend)", "area": "Санкт-Петербург", "experience": "От 1 года"}, {"url": "https://www.superjob.ru/vakansii/inzhener-radioelektronschik-1-kategorii-43148990.html", "platform": "superjob.ru", "salary": 100000, "description": "Обязанности:\n\n - участие в проектировании устройств по ТЗ\n- написание программ для микроконтроллеров различных производителей (Atmel, STM32 и др.)\n- написание прикладных программ для ПК\n- разработка и согласование технических заданий и технических условий. \n\nТребования:\n - высшее (техническое) образование\n- знание С++, Python, Java\n- опыт работы с контроллерами Atmel, Cortex\n- приветствуются знания схемотехники, оптоэлектроники, умение паять и т.п. \n\nУсловия:\n- работникам ПАО \"Радиофизика\" предоставляется право на отсрочку от призыва на военную службу по мобилизации;\n- стабильная, официальная заработная плата;\n- периодическая индексация заработной платы;\n- периодический медицинский осмотр;\n- соц. пакет: дополнительное медицинское обслуживание;\n- ст. м. Планерная, ул. Героев Панфиловцев, д. 10 (шаговая доступность от станции метро).", "title": "Инженер-радиоэлектронщик 1 категории", "area": "Москва", "experience": "Без опыта"}, {"url": "https://www.superjob.ru/vakansii/programmist-linux-45695529.html", "platform": "superjob.ru", "salary": 100000, "description": "Требования:\n• Знание TCP/IP;\n• Умение работать с системами контроля версий;\n• Желательно: опыт написания переносимого и безопасного кода;\n• Желательно: опыт написания кода ядра;\n• Желательно: понимание архитектуры современных ОС.\n• Хорошее знание C;\n• Хороший опыт работы в Unix системах, знание основных утилит командной строки, средств отладки.\n• Представление о системах контроля версий git (или svn).\n• Опыт отладки в gdb.\n• Представление об утилите make и мейкфайлах.\nЖелательные знания:\n• Знание C++, lua, Go lang, qt.\n• Знание хотя бы одного из скриптовых языков: perl, python, lua.\n• Представление об autoconf, automake.\n• Представление об утилите и/или библиотеке openssl.\n• Базовые представления о криптографии: симметричные и асимметричные ключи, сертификаты, шифрование, электронная подпись.\n• Большим плюсом будет наличие представления о формате ASN.1.\nУсловия:\n\n• Зарплата обсуждается в зависимости от опыта работы, уровня квалификации и соответствия требованиям вакансии;\n• Возможность профессионального и карьерного роста; \n• Оформление по ТК РФ (трудовой договор, трудовая книжка); \n• Расположение офиса: между м. ул. 1905 г. и м. Беговая (с 8-00 до 20-30 автобус компании по расписанию возит сотрудников к / от метро).", "title": "Программист Linux", "area": "Москва", "experience": "От 3 лет"}, {"url": "https://www.superjob.ru/vakansii/uchitel-informatiki-46296647.html", "platform": "superjob.ru", "salary": 100000, "description": "Обязанности:\n\n• Качественное ведение уроков информатики (1,5 ставки - классы обсуждаются) \n• Подготовка к экзаменам и олимпиадам, городским конференциям и конкурсам, \n• Ведение внеурочной деятельности, дополнительного образования\nТребования:\n• Высшее профильное образование\n• Диагностика МЦКО (высокий/экспертный уровень по информатике)\n\n• Опыт работы учителем информатики (подготовка к ОГЭ/ЕГЭ, олимпиадам и конференциям)\n\n• Владение ПК\n\n• Справка о несудимости (обязательно!)\n\n• Медицинская книжка и пр. документы, предусмотренные ТК РФ для пед.работников\nУсловия:\n• Стабильная заработная плата и стимулирующие выплаты\n• Социальный пакет (оплата отпусков, листков нетрудоспособности, повышение квалификации и пр.)\n\nСотрудник требуется с 1 сентября 2023 г. \nВ сопроводительном письме к отклику просьба указать уровень диагностики МЦКО", "title": "Учитель информатики", "area": "Москва", "experience": "От 1 года"}, {"url": "https://hh.ru/vacancy/83099990", "platform": "hh.ru", "salary": 85000, "description": "\nТребования: Готовность быстро учиться и развивать в себе недостающие навыки. Будет являться преимуществом навыки программирования. Будет являться преимуществом знание SQL, <highlighttext>Python</highlighttext>.\nОбязанности: Сбор и анализ данных по пассажиропотокам в различных плоскостях. Формирование и ведение базы ключевых показателей транспортных перевозок. Участие в разработке...", "title": "Специалист отдела аналитики", "area": "Москва", "experience": "Нет опыта"}, {"url": "https://hh.ru/vacancy/83055812", "platform": "hh.ru", "salary": 80000, "description": "\nТребования: Требуемые навыки: Опыт работы не менее 6 месяцев. Знание <highlighttext>Python</highlighttext>. Представление об ООП. Представление о работе с БД, понимание основных...\nОбязанности: Описание проекта: Обойтись. Основную часть работы составляет backend-разработка, требующая. Решения разнообразных нетривиальных задач, в том числе с взаимодействием. ", "title": "Junior backend-разработчик на Python", "area": "Москва", "experience": "От 1 года до 3 лет"}, {"url": "https://www.superjob.ru/vakansii/programmist-bekend-ai-46795750.html", "platform": "superjob.ru", "salary": 80000, "description": "Обязанности:\n\nМы ищем специалиста, способного дополнить команду работающую над разработкой продукта связанного с AI / LLM моделями.\nНаша команда состоит из профессионалов, которые успешно получили стартап-пермит в Силиконовой долине, мы создаем продукты на основе LLM. В данный момент мы нацелены на создание интерактивного помощника, обучаемый инструмент для повседневного участия в работе человека и приложения.\nЧто нужно будет делать в рамках команды:\n• Проектировать, разрабатывать и внедрять новый продуктовый функционал решений, интеграций, API;\n• Разработка нового функционала на Python / Django (или С#, C++), приветствуется иметь навыки написания кода на других языках программирования;\n• Разработка программного обеспечения на базе СУБД PostgreSQL;\n• Подготовка данных для обучения и тестирования моделей;\n• Поиск точек роста, узких мест, нахождение путей улучшения качества моделей за счет данных;\n• Предобработка, фильтрация и сегментация данных;\n• Выстраивание архитектуры и написание пайплайнов разметки данных;\n• Проводить тестирование и оптимизацию текущих моделей, работа с метриками;\n• Оптимизировать существующие решения, в т.ч. архитектурные с точки зрения производительности и надежности;\n• Довести качество до ChatGPT, помогать решать бизнес задачи приложения с помощью нашей технологии;\n• Участие в эксплуатации и развитии ИТ-инфраструктуры организации;\n• Заниматься непрерывным обменом знаниями со всей командой разработчиков;\n• Регулярное проведение knowledge sharing sessions является частью нашей культуры;\n• Регулярное проведение статус отчетов (Вторник, Четверг 20:00 - 21:00 мск);\n• Решение задач в режиме стартапа, ответственность за результат;\n• Анализ и оптимизация существующего кода;\n• Рефакторинг текущей кодовой базы, проведение ревью;\n• Поиск ошибок, их устранение;\n• Разработка интеграций с различными внешними системами;\n• Оптимизация сервисов под высокие нагрузки;\n• Работа с ОС Linux (CentOS, openSUSE и др.), Asta linux, Windows (7,10,11, server 2012 – 2019);\nБыть гибким в мышлении, трудолюбивым, жить своим делом. Быть честным и преданным. Не лениться, не быть гордым, быть компромиссным и вежливым, терпеливым. Обеспечить высочайшее качество взаимодействия, выполнять все оперативно. Принимать достойно критику, стараться подстроиться и быть словно единым целым с этим делом.\nТребования:\nВысшее техническое или неоконченное высшее образование (профильное);\n• Опыт коммерческой разработки клиент-серверных приложений;\n• Понимание ООП/GoF/SOLID;\n• Понимание Natural Language Processing (NLP) , знакомство с LangChain и Large Language Model (LLM) , а также базовый Elastic Search будет плюсом;\n• Опыт работы с RESTful API, интеграция с внешними сервисами;\n• Знание основ работы с базами данных, опыт работы с PostgreSQL или MySQL;\n• Понимание принципов работы машинного обучения, опыт работы с TensorFlow, Keras или PyTorch будет преимуществом;\n• Отличное знание Python 3, библиотек для разработки API и работы с данными (FastAPI, Pandas, Numpy, SQL Alchemy, asyncio);\n• Отличное знание подходов CI/CD и их реализации на GitLab;\n• Отличное знание PostgreSQL;\n• Уверенное знание .NET, C#;\n• Опыт построения решений в микросервисной архитектуре;\n• Работа по задачам с высокой степенью неопределенности;\n• Опыт постановки задач и сбора требований напрямую от заказчика, без детальной проработки у аналитика. Желание самому предлагать идеи реализации и проявлять инициативу в целом;\n• Умение работать с системами управления версиями (Git), таск-трекинга;\n• Умение писать качественные комментарии;\n• Опыт разработки нагруженных многопользовательских систем;\n• Опыт работы с данными и алгоритмами, отличное знание SQL, Pandas, FastAPI;\n• Понимание Deep learning (DL), опыт обучения просто моделей и больших моделей;\n• Участие в проектировании архитектуры, выработке решений по отказоустойчивости и производительности;\n• Разработка нового и доработка существующего back-end и front-end функционала;\n• Ответственность, дисциплинированность, стрессоустойчивость;\n• Читать техническую документацию на английском языке;\nЖелательно:\nУмение разбираться в чужом коде;\n• Понимание работы http, https. REST, RESTful, SOAP;\n• Опыт работы с highload-сервисами;\n• Опыт работы с ClickHouse, Pinecone;\n• Опыт работы с Flask;\n• Опыт docker/kubernetes, docker-compose;\n• Опыт создания проектов с \"0\";\n• Опыт/понимание математики и геометрии и алгоритмов связанных с математикой и геометрией;\n• Опыт проектирования и развития высоконагруженных систем;\n• Опыт работы с MySQL / Postgres;\n• Опыт работы c redis / rabbitmq;\n• Опыт управление командой разработчиков;\n• Желание много работать и учиться;\n• Разговаривать на английском языке;\n\nУсловия:\nДистанционное взаимодействие (как минимум первые 6 месяцев). Вы работаете у себя дома;\n• Доступно соискателям с инвалидностью;\n• Достойная заработная плата по результатам собеседования в зависимости от опыта и навыков;\n• Возможно оформление: договор услуг, подряда, ГПХ, самозанятые, ИП;\n• Возможна полная занятость 5/2 8 часов (график обсуждаетсяс учётом Ваших пожеланий);\n• Возможна подработка: сменами по 4-6 часов или по вечерам;\n• Своевременная выплата зарплаты;\n• Профессиональная команда единомышленников;\n• Открытость руководства к изменениям и улучшениям, без бюрократии;\nРаботая с нами, ты:\n\n• Обогатишь свой опыт участия в разработке и запуске приложений/сервисов от идеи до вывода на рынок;\n• Обретёшь профессиональная команду единомышленников;\n• Сможешь работать, не выходя из дома;\n• Станешь созидателем проекта мирового масштаба;\n• Прокачаешь английский язык;\n• Получаешь возможности карьерного роста (Компания постоянно развивается и растёт);\nНа данном этапе мы создаем юридическое приложение и нам важно найти специалиста, который занимался системами обработки текстовой информации, интересуется машинным обучением и способен применять существующие модели, а в перспективе стать ключевым игроком в продуктовой и технической реализации проекта.\nУважаемые соискатели, просьба указывать ожидаемый уровень З/П на руки в сопроводительном письме!", "title": "Программист Бэкенд AI", "area": "Москва", "experience": "От 1 года"}, {"url": "https://hh.ru/vacancy/83019820", "platform": "hh.ru", "salary": 75000, "description": "\nТребования: У Вас есть опыт на ЙТ-стажировках или от года в рамках разработки и выпуска ПО. Высшее образование в области...\nОбязанности: Ключевая задача – поддержание работоспособности текущего софта, разработка нового ПО для оптимизации процессов компании и разработка решений по автоматизации внутренних процессов. ", "title": "Инженер-программист (Junior)", "area": "Санкт-Петербург", "experience": "От 1 года до 3 лет"}, {"url": "https://hh.ru/vacancy/82933897", "platform": "hh.ru", "salary": 55000, "description": "\nТребования: Базовые навыки: HTML, CSS, JavaScript. Кроссбраузерная, адаптивная / гибкая / Pixel Perfect верстка. Опыт программирования: от 0 до 1 года. \nОбязанности: Фреймворки и библиотеки: Vue / React.js. Система контроля версий git. Верстки по макетам из Figma / FigJam. Взаимодействие с сервером: REST API...", "title": "Junior Frontend разработчик (Стажер)", "area": "Москва", "experience": "Нет опыта"}, {"url": "https://hh.ru/vacancy/83050891", "platform": "hh.ru", "salary": 50000, "description": "\nТребования: Базовый набор команд Linux. Уверенные знания <highlighttext>Python</highlighttext>3. Опыт работы с одним из web framework <highlighttext>Python</highlighttext>(Flask/Django/FastAPI и...\nОбязанности: Прототипирование информационных систем класса CRM, ITSM с нуля или на базе Open Source решений. Back-end разработка. Принимать активное участие...", "title": "Junior Backend Developer (Python)", "area": "Воронеж", "experience": "От 1 года до 3 лет"}, {"url": "https://samara.superjob.ru/vakansii/programmist-web-46816401.html", "platform": "superjob.ru", "salary": 50000, "description": "Условия:\n\n• График работы – 5/2.\n• Официальное трудоустройство.\n• Возможность профессионального и карьерного роста.\nТребования:\n\n• Знание и понимание принципов работы OS Linux.\n• Понимание асинхронного программирования.\n• Знание Python или РнР, работа с базами данных (Postgres, MySQL, MongoDB).\n• Опыт разработки web-приложений. Навык использования Git.\n• Опыт использования Docker.\nОбязанности:\n\n• Разработка мобильных Web приложений.", "title": "Программист Web, php, Python", "area": "Самара", "experience": "От 1 года"}, {"url": "https://hh.ru/vacancy/83064546", "platform": "hh.ru", "salary": 40000, "description": "\nТребования: Знание SQL. Владение языками программирования. Знание Java, C#, <highlighttext>Python</highlighttext>, C++. Опыт работы с PostgreSQL / Postgres Pro, Oracle, My SQL, MS...\nОбязанности: Разработка настольных и веб-приложений. Разработка баз данных. Настройка системы. Тестирование результатов и устранение замечаний. Введение в проектную деятельность: Современные...", "title": "Стажер-разработчик", "area": "Санкт-Петербург", "experience": "Нет опыта"}, {"url": "https://svetlograd.superjob.ru/vakansii/prepodavatel-kompyuternyh-kursov-46545441.html", "platform": "superjob.ru", "salary": 35000, "description": "Компьютерная Академия ТОР – крупнейшее учебное заведение России, специализирующееся на IT-образовании. К 2022 году мы открыли и успешно работаем в 190 филиалах на территории Российской Федерации. Филиал Академии приглашает к себе в команду инициативного и ответственного человека на должность преподавателя (ментора, куратора и т.д.) компьютерных курсов, по направлениям:\n-Программирование на Python Junior\n-Разработка приложений на Python Middle\n-Искусственный интеллект Python senior\n-Веб-дизайн Junior (HTML & CSS)\nОбязанности:\n• Проведение практических занятий в группах до 16 человек в соответствии с учебными планами и материалами (все методические материалы уже есть, придумывать ничего не нужно!).\n• Выдача и проверка домашних заданий, так же в соответствии с учебным материалом.\n• Участие в мероприятиях, организуемых в рамках академии (мастер-классы, открытые уроки, хакатоны, внеурочные мероприятия т.д.)\n\nТребования:\n• Ответственность, пунктуальность, желание делиться знанием и опытом;\n• Знание или опыт работы как минимум в одном из указанных выше направлений компьютерных технологий;\n• Навыки общения с детьми;\n• Педагогический опыт, педагогическое образование приветствуется.\n\nУсловия:\n• Достойная заработная плата;\n• Гибкий график работы/ частичная занятость;\n• Возможность сформировать оптимальную рабочую нагрузку;\n• Возможность профессионального и карьерного роста;\n• Комфортные условия работы в офисе\nРассматриваем кандидатов без опыта.", "title": "Преподаватель компьютерных курсов", "area": "Светлоград", "experience": "Без опыта"}, {"url": "https://perm.superjob.ru/vakansii/operator-call-centra-44275930.html", "platform": "superjob.ru", "salary": 35000, "description": "ПАО «Ростелеком» - крупнейший в России интегрированный провайдер цифровых услуг и решений, который присутствует во всех сегментах рынка и охватывает миллионы домохозяйств, государственных и частных организаций\n\nЧто нужно будет делать:\n• Консультировать наших действующих клиентов по телефону;\n• Помогать в решении вопросов клиентов;\n• Сохранять клиентов: информировать об акциях, персональных предложениях и программах лояльности;\n• Работать в офисных программах.\nКого мы ищем:\n• Вы готовы учиться новому и постоянно развиваться;\n• Являетесь уверенным пользователем ПК;\n• Обладаете грамотной речью;\n• Только начинаете свой карьерный путь или уже имеете опыт работы.\nКакие условия мы предлагаем:\n• Официальное трудоустройство в крупной, стабильной компании;\n• Официальный доход (оклад+премия);\n• График 5\\2 с плавающими выходными (выходные согласовываются с руководителем, пожелания учитываются);\n• Рабочее место в комфортном офисе, с зонами для питания и отдыха;\n• Обучение за счёт компании;\n• Атмосфера поддержки, наставничество на обучении и в период адаптации;\n• Возможности для карьерного роста и развития;\n• Корпоративный университет всегда открыт, бесплатные знания и программы обучения на любой вкус от менеджмента до \"Python для продвинутых\";\n• Работа в амбициозной и сплоченной команде;\n• Скидки на услуги компании и бонусы от партнеров.\n\nЕсли остались вопросы скорее откликайтесь и ждите звонок для обсуждения условий по телефону.", "title": "Оператор call-центра", "area": "Пермь", "experience": "Без опыта"}, {"url": "https://spb.superjob.ru/vakansii/metodist-po-programmirovaniyu-na-python-38140998.html", "platform": "superjob.ru", "salary": 30000, "description": "Примечание:\n• с 1 сентября 2022 на базе Лицея 126 открыт Центр цифрового образования \"ИнфинITи\", в который требуются методист по программированию на различных языках (Python обязательно)\nОбязанности:\n• Методическое сопровождение мероприятий центра по направлению \"Программирование на Python \").\n• Поиск и внедрение в план работы педагогов внешних конкурсов и мероприятий технической направленности. \n• Составление программ дополнительного образования.\n• Взаимодействие с внешними партнерами центра.\n• Методическое сопровождение педагогов центра\nТребования:.\n• Ответственность \n• Грамотность \n• Уверенное владение ПК\n• Отсутствие вредных привычек\nУсловия:\n• Рабочий день с 11:00\n• Официальное трудоустройство\n• Соцпакет\n• Бассейн\n• Оплачиваемый отпуск летом 56 дней\n• Возможность внутреннего совмещения по должности администратор, или педагог дополнительного образования", "title": "Методист по программированию на Python (в центр цифрового образования)", "area": "Санкт-Петербург", "experience": "От 1 года"}, {"url": "https://chita.superjob.ru/vakansii/specialist-sluzhby-podderzhki-s-tehnicheskimi-znaniyami-39820615.html", "platform": "superjob.ru", "salary": 15000, "description": "Для помощи по вопросам десктопной версии Яндекс.Браузера разыскивается человек, который умеет не только выйти в интернет, но и знает, как потом не принести из него что-то вредное. Ваши сверхспособности понадобятся, чтобы знакомить пользователей с полезными возможностями Браузера. Например, рассказывать, как настроить фильтр рекламы или синхронизировать настройки Браузера на нескольких устройствах. Если вы из тех, кому любопытно разбираться, почему что-то не работает, и нравится помогать людям, присоединяйтесь.\nЧто нужно делать:\n· отвечать на сообщения пользователей по почте и в чатах;\n· консультировать их о вопросах, связанных с Яндексом;\n· передавать информацию разработчикам и менеджерам, помогая улучшать сервисы;\n· иногда решать новые интересные задачи — ведь мы постоянно растем и меняемся.\nМы ждем, что вы:\n· грамотно пишете по-русски;\n· умеете четко и структурированно излагать мысли;\n· легко находите главную информацию в текстах разного объема;\n· умеете читать языки JavaScript, HTML и Python;\n· имеете высшее или неоконченное высшее образование (техническое будет плюсом);\n· помогали людям онлайн;\n· умеете работать самостоятельно и в команде;\n· готовы к гибкому графику;\n· ответственны, стрессоустойчивы, самоорганизованны;\n· умеете работать с большим объемом информации;\n· готовы учиться;\n· не устаете от однообразных задач.\nУсловия:\n· работа из дома;\n· оформление совместительства;\n· частичная занятость: 20 рабочих часов в неделю;\n· гибкий график: 5-дневная рабочая неделя, 4 рабочих часа в день, плавающие выходные, начало смен обсуждается индивидуально;\n· сдельная оплата;\n· удаленное оплачиваемое обучение.\n Доступно соискателям с инвалидностью", "title": "Специалист службы поддержки с техническими знаниями (Браузер)", "area": "Чита", "experience": "Не имеет значения"}, {"url": "https://hh.ru/vacancy/82868871", "platform": "hh.ru", "salary": 2500, "description": "\nТребования: Rest/Fast/GraphQL Api + умение пользоваться док-ей, SQL (My / Lite), Selenium, Bs4, Qt5. Django/Flask, Умение...\nОбязанности: Работать предстоит с созданием приложений (оконных и веб), дополнений к CRM системам, панелей управлений и их модерацией. Также с Мессенджерами...", "title": "Разработчик python (возможно обучение)", "area": "Брест", "experience": "Нет опыта"}, {"url": "https://hh.ru/vacancy/83095226", "platform": "hh.ru", "salary": 2000, "description": "\nТребования: Опыт коммерческой разработки от 2 лет. Знания по ООП (SOLID, паттерны проектирования). Протоколы TCP/IP/HTTP. Английский язык на уровне...\nОбязанности: OОО «Безопасность Он-Лайн» - системный интегратор, специализирующийся на информационно-техническом обслуживании интегрированных и распределенных систем безопасности у корпоративных клиентов (видеонаблюдение...", "title": "Ведущий программист Python", "area": "Минск", "experience": "От 1 года до 3 лет"}, {"url": "https://www.superjob.ru/vakansii/analitik-dannyh-46781769.html", "platform": "superjob.ru", "salary": 0, "description": "Обязанности:\n \n• создавать, развивать и поддерживать регулярную отчетности для топ-менеджмента;\n \n• создавать Ad-hoc аналитические отчеты для проверки продуктовых гипотез по запросу руководства;\n \n• генерировать и проверять статистические гипотезы;\n \n• определять ключевые метрики по новым фичам, прогнозировать как они увеличатся после запуска фичи и следить за их выполнением;\n \n• создавать системы аналитических бордов по клиентским и продуктовым метрикам в BI системах.\n \nТребования:\n \n• знание Teradata, Hadoop, DBeaver, Bigquery, Python, PyCharm, JupyterHub, Yandex Metrica, AppMetrica, PowerBI, QlickSense;\n \n• знание SQL (сложные запросы, оконные функции);\n \n• знание python (библиотеки для аналитиков, pyspark);\n \n• опыт построения бордов(powerbi, qlick sense);\n \n• опыт работы в Yandex Metrica и AppMetrica;\n \n• знание основных продуктовых метрик и как их считать;\n \n• будет плюсом умение строить модели ML.\n \nУсловия:\n \n• трудоустройство согласно Законодательству;\n \n• конкурентная заработная плата;\n \n• профессиональное обучение и развитие;\n \n• добровольное медицинское страхование, льготные условия кредитования;\n \n• корпоративная пенсионная программа, материальная помощь;\n \n• спортивная жизнь и корпоративные мероприятия;\n \n• возможность построить карьеру в ведущем банке России.", "title": "Аналитик данных (Управление Сквозные бизнес-компоненты)", "area": "Москва", "experience": "От 3 лет"}, {"url": "https://mo.superjob.ru/vakansii/uchitel-po-programmirovaniyu-45698484.html", "platform": "superjob.ru", "salary": 0, "description": "Обязанности:\n• \nОбучение детей (4-14 лет) в группах программированию \n• \nФормирование у учеников логического системного мышления и развитие технических творческих способностей \n\n• Обучение детей основам проектной работы в IT\n• Поддержание интереса и мотивации учеников \nТребования:\n• \nОпыт работы с детьми (аниматор, репетитор, воспитатель, вожатый, учитель, опытный родитель или старший брат/сестра\n• Уверенное владение компьютером. В идеале, знание основ алгоритмического языка и программирования. (Предпочтительно: Scratch JR, Scratch, Snap, Stencyl, Tynker, Blockly, Перволого, Пиктомир)\n• Умение объяснять сложное простыми (иногда детскими) словами \n• Любовь к детям и умение направить их энергию в нужное русло \n\n• Знание текстовых языков программирования Python, Java и прочее - желательно \n\nУсловия:\n• \nУдобный график (очень многое можно скорректировать совместно с администратором) \n• Возможность обучать мотивированных детей, которые стремятся узнать все о современных технологиях и не только \n• Увлеченная команда преподавателей \n\n• Интересные и амбициозные задачи\n• Профессия квалифицированного детского IT тренера - одна из самых востребованных на рынке труда", "title": "Учитель по программированию", "area": "Менделеево", "experience": "Без опыта"}, {"url": "https://www.superjob.ru/vakansii/data-scientist-46185192.html", "platform": "superjob.ru", "salary": 0, "description": "Обязанности:\n• Использовать алгоритмы машинного обучения для решения бизнес-задач \n• Исследовать данные с целью получения новых признаков \n• Разрабатывать требования для сбора данных, дизайн A/B тестов \n• Заниматься написанием эффективного кода для получения агрегатов данных \n• Развивать инфраструктуру для автоматического построения и использования моделей машинного обучения \nТребования:\n• Высшее техническое образование \n• Уверенное знание SQL и готовность писать эффективные запросы\n• Уверенное владение Python (библиотеки работы с данными)\n• Опыт использования и внедрения алгоритмов машинного обучения\n• Знание базовых алгоритмов и структур данных, понимание плюсов и минусов \n• Уверенное знание математической статистики, умение применять для решения задач \n• Технический английский на уровне чтения статей и участия в конференциях \nУсловия:\n• формат работы;\n• График работы: 5/2; 8.00-17.00, 9.00-18.00 или 10.00-19.00 (на выбор);\n• Полугодовой бонус;\n• ДМС - после испытательного срока;\n• Дисконтная карта на продукцию 30% магазинов сети + корпоративные скидки и специальные условия от партнеров;\n• Обучение - доступно внутреннее и внешнее обучение, проводим внутренние митапы, техтолки, посещаем профильные конференции;\n• Некоторые бонусы предоставляются по принципу \"кафетерия\". Расскажем об этом подробнее при первом контакте.", "title": "Data Scientist", "area": "Москва", "experience": "От 1 года"}, {"url": "https://nsk.superjob.ru/vakansii/php-mysql-razrabotchik-46821474.html", "platform": "superjob.ru", "salary": 0, "description": "В компанию по агрегированию и распространению музыкального и видео контента требуется PHP MySql - программист на удаленной основе, полная занятость. \nУ нас вы найдете интересные задачи, профессиональные вызовы и возможность отлично реализовать свой потенциал на различных проектах .\nОбязанности:\n• \nРазработка бэкенда и фронтенда\n• \nРазработка новых фич и доработка существующих\n\n• \nРазработка и адаптивная верстка пользовательских веб интерфейсов \nТребования:\n• Знания PHP, MySQL\n• Знания в java script и одного из фреймворков (react или vue.js)\n• Опыт разработки баз данных от 3х лет\n• Пишешь чистый код и применяешь дизайн и архитектурные паттерны;\n• Способность разбираться в чужом коде\n\n• Способность работать в команде с другими разработчиками.\nУсловия:\n• Испытательный срок - 2 месяца;\n• Можно работать парт-тайм\n• Гибкий график работы\n• Удаленная работа\nМы работаем примерно 8 часов в день, 5 дней в неделю.\nВыходные и праздничные дни отдыхаем. Нет жесткого контроля времени, все на доверии - получаете задачу, даете оценку, приступаете к выполнению.", "title": "PHP MySQL-разработчик", "area": "Новосибирск", "experience": "От 6 лет"}, {"url": "https://www.superjob.ru/vakansii/analitik-otdela-prodazh-46400350.html", "platform": "superjob.ru", "salary": 0, "description": "SuperJob — это инновационная IT-компания, которая помогает соискателям найти работу, а работодателям — приобрести ценного сотрудника.\nЕжемесячно нашим сервисом пользуются миллионы соискателей и десятки тысяч работодателей, среди которых РЖД, Мегафон, МТС, Леруа Мерлен, Почта России, Сбербанк, Альфа-Банк, Ригла и многие другие. Мы активно развиваем нашу платформу и делаем ее лучше, подтверждая миссию «Работа должна доставлять удовольствие!»\nВам предстоит:\n• Собирать, анализировать и консолидировать данные по продажам.\n• Работать с большими объемами данных.\n• Анализировать маркетинговые активности.\n• Работать с сегментацией клиентов.\n• Ежедневно контролировать ключевые показатели. \n• Тестировать гипотезы по улучшению метрик, проводить А/Б тесты и интерпретировать их результаты. \n• Анализировать причинно-следственную связь метрик с основными бизнес-процессами компании. Давать рекомендации по их улучшению.\nОт своего будущего коллеги мы ждем:\n• Продвинутого уровня использования Google analytics, Яндекс.Метрик.\n• Опыта работы в любой BI-системе (у нас Tableau).\n• Хорошего знания Excel.\n• Знания SQL (навыки написания сложных запросов, знание оконных функций).\n• Опыта работы с Python.\nСвоему будущему коллеге мы предлагаем:\n• Работу в одном из самых быстрорастущих рынков - HRTech.\n• Непрерывное профессиональное развитие внутри компании.\n• Возможность стать частью сплоченной команды, любящей свое дело.\n• Официальную заработную плату.\n• Современный офис в 10 минутах пешей прогулки от станций метро Пушкинская/Маяковская/Чеховская/Новослободская.\n• Спортивный уголок.\n• Комфортную зону отдыха.\n• Кофе-поинты с вкуснейшим кофе и вендинговым аппаратом.\n• Оборудованное просторное место для питания.\n• Оплату проезда общественным транспортом.", "title": "Аналитик отдела продаж", "area": "Москва", "experience": "От 3 лет"}]